/**
 * 全局配置文件
 */
import config from '../../package.json'
export default {
    base_title: document.title || '管理平台',
    copyright: 'Copyright © 2021-2022 希迪克（郑州）智能康复设备有限公司 All Rights Reserved.',
    version: config.version,
    pattern: {
        // 邮件
        email: /^\+?[a-z0-9](([-+.]|[_]+)?[a-z0-9]+)*@([a-z0-9]+(\.|\-))+[a-z]{2,6}$/,
        // 密码; 1 可以全数字，2 可以全字母，3 可以全特殊字符(~!@#$%^&*.)，4 三种的组合，5 可以是任意两种的组合，6 长度6-22
        pass: /^[\@A-Za-z0-9\!\#\$\%\^\&\*\.\~]{6,22}$/,
        // 验证码
        sms: /^\d{4}$/,
        // 公司名称
        companyName: /^[\(\)\（\）\u4E00-\u9FA5]+$/,
        // 信用代码
        uscc: /^[1-9A-GY]{1}[1239]{1}[1-5]{1}[0-9]{5}[0-9A-Z]{10}$/,
        // 身份证
        card: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
        cards: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,
        card15: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/, // 15位身份证
        card18: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/, // 18位身份证
        // 手机号（支持手机号码，3-4位区号，7-8位直播号码，1－4位分机号）
        phone: /^(\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$/,
        // 全数字
        number: /^[0-9]*$/,
        // 数字或小数
        number2: /^[0-9]+\.{0,1}[0-9]{0,2}$/,
        // 用户名
        // regName: /^[a-zA-z][a-zA-Z0-9_]{3,16}$/,
        regName: /[a-zA-z0-9]{3,16}$/,
        // 手机号
        mobile: /^1[34578]\d{9}$/,
        trim: /^(?=.*\S).+$/
    }
}
